"==================================List====================================="
# списки - изменяемый, индексируемый, упорядоченный, итерируемый тип данных, предназначенный для хранения любых данных в определенном порядке

list1 = [1, 2, 3, 'hello', True, False, [2,3,4,5,6], None]
print(list1) # [1, 2, 3, 'hello', True, False, [2, 3, 4, 5, 6], None]

print(list1[3]) # hello
print(list1[-1]) # None
print(list1[-2][0]) # 2


list2 = list('hello') # ['h', 'e', 'l', 'l', 'o']
print(list2)

list3 = list(range(1, 51))
print(list3)#[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]

"===========================Методы списков=============================="
# append() - добавляет элемент в конец списка

list2 = []
list3 = [1, 2, 3]
list2.append(True)
print(list2) # [True]
list3.append(None) # [1, 2, 3, None]
print(list3)

# pop() - удаляет(и возвращает) элемент из списка по индексу и результатом метода будет удаленный элемент, если не передать индекс - удалит с конца
list1 = [1, None, True, False, 3, 4, 5]
popped = list1.pop()
print(list1)
print(popped)
list4 = []
# list4.pop() # IndexError: pop from empty list

# remove() - удаляет элемент из списка по значению
list1.remove(False)
print(list1) # [1, None, True, 3, 4]

list3 = [1,1,1,1,1,1,1,1,2,2,2,2,2,2]
list3.remove(1)
print(list3)

# count() - считает количество принятого элемента в списке
list3 = [1,1,1,1,1,1,1,1,2,2,2,2,2,2]
print(list3.count(False)) # 8


# index() - возвращает индекс первого вхождения принятого элемента
list3 = [1,1,1,1,1,1,1,1,2,2,2,2,2,'hello']
print(list3.index('hello')) # 13

# insert() - добавляет элемент в список по индексу
list4 = [[1, 2, 3, 4], True, False, 'hello world', '123']
list4.insert(0, 5)
print(list4) # [5, [1, 2, 3, 4], True, False, 'hello world', '123']

# extend() - добавляет элементы принятого списка в первый список, изменяя его
list1 = [1, 2, 3, 4, 5]
list2 = ['a', 'b', 'c', 'd', 'e']
list2.extend(list1)
print(list2) # ['a', 'b', 'c', 'd', 'e', 1, 2, 3, 4, 5]
print(list1) # [1, 2, 3, 4, 5]

# reverse() - изменяет список, расставляя его элементы в обратном порядке
list2.reverse()
print(list2) # [5, 4, 3, 2, 1, 'e', 'd', 'c', 'b', 'a']

# sort() - сортирует список, состоящий из элементов одного типа данных 
list5 = [12, 23, 123, 321, 54335, 12309, 123, 1, 2, 3, 4,0]
list5.sort()
print(list5) # [0, 1, 2, 3, 4, 12, 23, 123, 123, 321, 12309, 54335]
list5.sort(reverse=True) # если нужно отсортировать по убыванию, то можно в скобках указать reverse=True
print(list5)

# clear() - очищает список
list5.clear()
print(list5) # []
print(dir(list5))


# len() - функция, которая считает количество элементов в последовательности
print(len(list4))


# Множественное присваивание
a, b, c  = 12, 23, 123
print(a)
print(b)
print(c)

a, b = ['hello world', 2]
print(a, b)